export default {
    // Одинарные кавычки вместо двойных
    semi: false,
    singleQuote: true,

    // Длина строки до переноса
    printWidth: 120,

    // Кол-во пробелов для отступа
    useTabs: false,
    tabWidth: 4,

    // запятая после последнего элемента в объектах и массивах
    trailingComma: 'all',

    // перенос стрелочных функций с одним аргументом
    arrowParens: 'always',

    // Пробелы внутри фигурных скобок в объектах
    bracketSpacing: true,

    // Сохранять существующие концы строк, которые уже судествуют в файле
    endOfLine: 'auto',

    // Отключить автоматическую вставку специального комментария "pragma"
    insertPragma: false,

    // Форматировать все файлы проекта при значении false
    requirePragma: false,

    // Кавычки у свойств объекта добавлять только при необходимости
    quoteProps: 'as-needed',
}
